package Units;
// Добавить файл с описанием интерфейса. В котором описать два метода, void step(); и String getInfo();
//  Реализовать интерфейсs в абстрактном классе и в наследниках так, чтобы getInfo возвращал тип персонажа. 
//  Создать два списка в классе main. В кждый из списков добавить по десять экземнляров наследников BaseHero. 
//  Удалить ненужные методы из абстрактного класса, если такие есть. 
// В main пройти по спискам и вызвать у всех персонажей getInfo.

interface myInterface{
    void step();
    String getInfo();
    }
    